RogerHuauya/drogui/dspic/Blink/test/dsp_test.c
//#define DSP_TEST
#ifdef DSP_TEST

#include <xc.h>
#include <dsp.h>
#include "config.h" 
#include "serial.h"
#include "matlib.h"
#include <libpic30.h>
fractional mat1[2][2];
fractional mat2[2][2];
fractional mat3[2][2];
serial Serial1;

char s[80];

int main(){
    initConfig();
    initSerial(&Serial1, SERIAL1, 115200);
    __delay_ms(1000);
    
    mat1[0][0] = Float2Fract(0.3); 
    mat1[0][1] = Float2Fract(0.2);
    mat1[1][0] = Float2Fract(0.1);
    mat1[1][1] = Float2Fract(0.8);

    mat2[0][0] = Float2Fract(-0.1);
    mat2[0][1] = Float2Fract(0.4);
    mat2[1][0] = Float2Fract(0.2);
    mat2[1][1] = Float2Fract(0.9);

    MatrixMultiply(2, 2, 2, &mat3[0][0], &mat1[0][0], &mat2[0][0]);

    sprintf(s, "%.2lf\t%.2lf\n%.2lf\t%.2lf\n\n", Fract2Float(mat3[0][0]), Fract2Float(mat3[0][1])\
                                                        , Fract2Float(mat3[1][0]), Fract2Float(mat3[1][1]));
    
    while(1){
        serialWriteString(&Serial1, s);
        __delay_ms(1000);
    }
}

#endif